xfire-aegis/src/test/org/codehaus/xfire/message/wrapped/echoOverload2.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <e:echo1 xmlns:e="urn:xfire:echo">
    <e:in0>yo</e:in0>
    <e:in1>yo</e:in1>
  </e:echo1>
 </env:Body>
</env:Envelope>